---
kind: type
id: T:Autodesk.Revit.DB.ColorBackgroundSettings
source: html/f879a275-8244-d98a-50c6-2142fdcca188.htm
---
# Autodesk.Revit.DB.ColorBackgroundSettings

Represents the rendering color background settings.

## Syntax (C#)
```csharp
public class ColorBackgroundSettings : BackgroundSettings
```